astarte-platform/astarte-device-sdk-esp32/examples/aggregates/main/app_main.c
/**
 * This file is part of Astarte.
 *
 * Copyright 2018-2023 SECO Mind Srl
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * SPDX-License-Identifier: LGPL-2.1-or-later OR Apache-2.0
 *
 **/

#include <esp_idf_version.h>
#include <esp_log.h>
#include <inttypes.h>
#include <nvs_flash.h>

#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/queue.h"
#include "freertos/task.h"

#include "example_task.h"
#include "wifi_cfg.h"

/************************************************
 * Constants/Defines
 ***********************************************/

#define TAG "ASTARTE_EXAMPLE_APP_MAIN"

/************************************************
 * Main function definition
 ***********************************************/

void app_main()
{
    ESP_LOGI(TAG, "[APP] Startup..");
    ESP_LOGI(TAG, "[APP] Free memory: %" PRIu32 " bytes", esp_get_free_heap_size());
    ESP_LOGI(TAG, "[APP] IDF version: %s", esp_get_idf_version());

    esp_log_level_set("*", ESP_LOG_INFO);

    nvs_flash_init();
    wifi_init();

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 3, 0)
    const configSTACK_DEPTH_TYPE stack_depth = 6000;
#else
    const uint32_t stack_depth = 6000;
#endif
    xTaskCreate(
        astarte_example_task, "astarte_example_task", stack_depth, NULL, tskIDLE_PRIORITY, NULL);
}
